---
kind: method
id: M:Autodesk.Revit.DB.View3D.SaveOrientationAndLock
zh: 三维视图、3d视图
source: html/460905b4-5f45-6a86-fa9e-fbcfcef2187d.htm
---
# Autodesk.Revit.DB.View3D.SaveOrientationAndLock Method

**中文**: 三维视图、3d视图

Locks the view and saves its orientation

## Syntax (C#)
```csharp
public void SaveOrientationAndLock()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Returns true if the view is not a view template.
 -or-
 The orientation of the View3D cannot be saved.